{"id":8,"date":"2020-12-01T15:53:54","date_gmt":"2020-12-01T15:53:54","guid":{"rendered":"http:\/\/hyperion.cs.upt.ro\/?page_id=8"},"modified":"2020-12-01T15:53:54","modified_gmt":"2020-12-01T15:53:54","slug":"novelty-and-objectives","status":"publish","type":"page","link":"http:\/\/hyperion.cs.upt.ro\/index.php\/novelty-and-objectives\/","title":{"rendered":"Novelty and Objectives"},"content":{"rendered":"\n<p>The literature reveals a lengthy list of DDI prediction models and drug interaction checkers; they both target only the interactions corresponding to one drug at a time, therefore not considering the poly-medication situations. Due to the complexity problems entailed by multiple (and some unexpected) interactions emerging in therapies that require a simultaneous administration of multiple drugs, in silico models have been proposed in accordance with official documents [1] and other important scientific papers [2][3]. Such recent developments were spurred by the tremendous developments in the field of network science [4][5], including its medical [6][7] and biological [8][9] applications. The network applications to the fields of biochemistry and pharmacology led to modeling the so-called interaction networks or interactomes [7]. A DDI interactome is a complex network where the nodes represent drugs and the links between them correspond to drug interactions.&nbsp;<\/p>\n\n\n\n<p>Taking DDI interactomes as inputs, the algorithms for complex network processing are used to reveal the following aspects: <\/p>\n\n\n\n<ol><li>Predicting potentially strong interactions that were previously unknown [10][11][12][13][14]; this idea is behind the development of software tools for drug interaction alert systems [15][16]; <\/li><li>Avoiding certain interactions during the drug design process, by employing computer-aided design tools [2][17]. <\/li><\/ol>\n\n\n\n<p>Consequently, for our HYPERION project, the specific objectives are:&nbsp;<\/p>\n\n\n\n<p><strong>O1 <\/strong>– Build, at server level, the drug interaction networks with data collected from public drug databases;&nbsp;<\/p>\n\n\n\n<p><strong>O2 <\/strong>– Build, at server level, the relevant DDI selection (i.e., filtering) model, using a machine learning approach that predicts the interaction strength;&nbsp;<\/p>\n\n\n\n<p><strong>O3 <\/strong>– Develop, at an individual user level, a smartphone application that will issue personalized drug interaction alerts (i.e., drug-drug and drug-food interactions); these alerts will be filtered according to their strength and relevance.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The literature reveals a lengthy list of DDI prediction models and drug interaction checkers; they both target only the interactions corresponding to one drug at a time, therefore not considering the poly-medication situations. Due to the complexity problems entailed by multiple (and some unexpected) interactions emerging in therapies that require a simultaneous administration of multiple [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"http:\/\/hyperion.cs.upt.ro\/index.php\/wp-json\/wp\/v2\/pages\/8"}],"collection":[{"href":"http:\/\/hyperion.cs.upt.ro\/index.php\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/hyperion.cs.upt.ro\/index.php\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/hyperion.cs.upt.ro\/index.php\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/hyperion.cs.upt.ro\/index.php\/wp-json\/wp\/v2\/comments?post=8"}],"version-history":[{"count":1,"href":"http:\/\/hyperion.cs.upt.ro\/index.php\/wp-json\/wp\/v2\/pages\/8\/revisions"}],"predecessor-version":[{"id":9,"href":"http:\/\/hyperion.cs.upt.ro\/index.php\/wp-json\/wp\/v2\/pages\/8\/revisions\/9"}],"wp:attachment":[{"href":"http:\/\/hyperion.cs.upt.ro\/index.php\/wp-json\/wp\/v2\/media?parent=8"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}